package zzzTest.JsoupTest;

public interface TestSourceText {
    //重庆
    String ChongQing2 = "统一社会信用代码：92500240MA5XPL9X7G；注册号：500240604301602；名称：石柱土家族自治县食再仁面馆；类型：个体工商户；经营期限：……登记机关：重庆市石柱土家族自治县工商行政管理局；登记日期：2014年11月06日；企业信用信息公示系统网址：gsxt.cqgs.gov.cn";
    String ChongQing3 = "统一社会信用代码：92500101MA5YTBDJ3K；注册号：500101612384165；名称：万州区太白路克伦特饮品店；类型：个体工商户；经营者：杨发培……登记机关：重庆市工商行政管理局万州区分局；登记日期：2018年03月20日；企业信用信息公示系统网址：gsxt.cqgs.gov.cn";
    String ChongQing = "统一社会信用代码：92500240MA5XETK25W；注册号：500240611429964；名称：石柱土家族自治县豪怡品餐馆；类型：个体工商户……登记机关：重庆市石柱土家族自治县工商行政管理局；登记日期：2017年10月25日；企业信用信息公示系统网址：gsxt.cqgs.gov.cn";
    //浙江
    String ZheJiang = "统一社会信用代码:92330106MA2B0MD386;注册号:330106600537798;企业名称:杭州市西湖区吴恩雄小吃店;多证合一:公章刻制备案;详询信用公示系统:http://gsxt.zjaic.gov.cn/";
    //天津
    String TianJin = "名称:天津市津南区占喜麻辣烫店;类型:个体工商户;经营场所:天津市津南区咸水沽镇静怡里18号楼104、105室;经营者:赵占喜;经营范围:热食类食品制售。（依法须经批准的项目，经相关部门批准后方可开展经营活动）;组成形式:个人经营;注册日期:2017年11月06日;注册号:120112600425431;统一社会信用代码：92120112MA05XKH12J;登记机关:天津市津南区市场和质量监督管理局;登记日期:2017年11月06日;企业信用信息公示系统网址:www.tjcredit.gov.cn;";
    //陕西
    String ShaanXi2 = "社会统一信用代码：92610113MA6UTDXT64;注册号:610113600819767;企业名称:西安市雁塔区罗晓熊餐饮店;登记机关:西安市工商行政管理局雁塔分局;登记时间:2018-04-09;详询信用公示系统:http://wsnj.xags.gov.cn/webgs/erwmcx/index.jsp?ID=6101130000882560";
    String ShaanXi = "社会统一信用代码：92610113MA6UTDXT64;注册号:610113600819767;企业名称:西安市雁塔区罗晓熊餐饮店;登记机关:西安市工商行政管理局雁塔分局;登记时间:2018-04-09;详询信用公示系统:http://wsnj.xags.gov.cn/webgs/erwmcx/index.jsp?ID=6101130000882560";

    //辽宁
    String LiaoNing = "个体工商户\n" +
            "统一社会信用代码:92210202MA0UJW5M7F\n" +
            "名称:中山区王一剪居酒屋饭店\n" +
            "类型:个体工商户\n" +
            "经营场所:辽宁省大连市中山区玉光街29号一层\n" +
            "经营者:房杰\n" +
            "组成形式:个人经营注册日期:2017年10月12日；经营范围:热食类食品制售（依法须经批准的项目，经相关部门批准后方可开展经营活动）。\n" +
            "http://gsxt.lngs.gov.cn";
    //山西
    String ShanXi = "统一社会信用代码:92140107MA0JRJT59U;\n" +
            "名称:太原市杏花岭区旭日新开商城芙蓉外卖店;\n" +
            "经营者:王旭;\n" +
            "开业日期:2017年10月19日;\n" +
            "企业信用信息公示系统网址:http://sx.gsxt.gov.cn/index.jspx/EntInfo.jspx?id=YmZrbG9xcXVyd3Fzc21zZW9n";
    //内蒙古
    String NeiMengGu = "注册号：150402600517965，" +
            "名称：红山区辣上瘾鸡公煲麻辣烫店，" +
            "类型：个体户，" +
            "经营场所：赤峰市红山区长青街中段原红山区检察院楼下大厅，" +
            "经营者：王卫东，" +
            "组成形式：个人经营，" +
            "注册日期：2015-06-25，" +
            "经营范围：餐饮服务等，" +
            "www.nmgxygs.gov.cn";
    //黑龙江
    String HeiLongJiang = "统一社会信用代码:92230203MA1B00KC4A;  \n" +
            "名称:建华区萱萱柳家紫菜包饭快餐店;  \n" +
            "经营者:李弘俊;  \n" +
            "成立日期:2018年02月08日;  \n" +
            "信用公示网址:http://gsxt.hljaic.gov.cn/EntInfo.jspx?id=YmNqbHVycXBvd3Zwd2t2anBkbw==  \n";
    //安徽
    String AnHui = "统一社会信用代码:92340111MA2Q3HGL07;  \n" +
            "经营者:陈光;  \n" +
            "名称:合肥经济技术开发区簋街美食馆;  \n" +
            "开业日期:2017年10月27日;  \n" +
            "企业信用信息公示系统网址:http://www.ahcredit.gov.cn/EntInfo.jspx?id=ZWFnbG9xcXh0dnZxd2hzYnFq  ";
    //福建
    String FuJian2 = "统一社会信用代码：92350121MA31J96XXA  \n" +
            "注册号：350121600331102  \n" +
            "名称：闽侯县上街姐弟俩肉蟹煲餐饮店  \n" +
            "企业信用信息公示系统网址：http://wsgs.fjaic.gov.cn/creditpub  \n" +
            "年度报告在线填报网址：http://wsgs.fjaic.gov.cn/creditpub/quick_login?entyId=oZtXP5eYMdhNj_qOvFeUVaLDCBNSsFu4  ";
    String FuJian = "统一社会信用代码：92350102MA2YCCLY1F  \n" +
            "注册号：350102600443209  \n" +
            "名称：福州市鼓楼区张叔餐饮店  \n" +
            "企业信用信息公示系统网址：http://wsgs.fjaic.gov.cn/creditpub  \n" +
            "年度报告在线填报网址：http://wsgs.fjaic.gov.cn/creditpub/quick_login?entyId=H08STCXmSmQ1YzDtSrQVecs2faJ2LVo6  ";

    //山东
    String ShanDong2 = "经营者：姜懂懂  \n" +
            "名称：芝罘区和糖恋饮品店  \n" +
            "类型：个体工商户  \n" +
            "经营场所：山东省烟台市芝罘区南大街166号百盛购物中心五楼  \n" +
            "组成形式：个人经营  \n" +
            "注册日期：2017-03-30  \n" +
            "统一社会信用代码：92370602MA3DEB3A1Y  \n" +
            "信用网址：http://sdxy.gov.cn  ";
    String ShanDong = "经营者：夏艳茹  \n" +
            "名称：威海经济技术开发区夏艳茹小吃店  \n" +
            "类型：个体工商户  \n" +
            "经营场所：威海经济技术开发区青岛中路256-1716号丰禾义乌小商品博览城四层H-3号  \n" +
            "组成形式：个人经营  \n" +
            "注册日期：2018-01-10  \n" +
            "统一社会信用代码：92371000MA3MKMBNXK  \n" +
            "信用网址：http://sd.gsxt.gov.cn  ";
    //海南
    String HaiNan = "统一社会信用代码:92460108MA5RHLTEXF;  \n" +
            "名称:海口美兰三湘人家蓝天路分店;  \n" +
            "经营者:符雷珍;  \n" +
            "开业日期:2007年12月06日;  \n" +
            "企业信用信息公示系统网址:http://hi.gsxt.gov.cn/EntInfo.jspx?id=YmVtbW9xcXBvcnFtdGp3ZW5k  ";
    //四川
    String SiChuan_ChengDu = "统一社会信用代码：92510105MA6CE3994M  \n" +
            "企业注册号：510105600620584  \n" +
            "名称：青羊区俊龙食品经营部  \n" +
            "登记机关：成都市青羊区市场和质量监督管理局  \n" +
            "登记日期：2018-04-27  \n" +
            "企业信用信息公示系统网址：http://www.cdgs.gov.cn  http://gsxt.cdcredit.gov.cn  ";

    //贵州
    String GuiZhou_GuiYang2 = "统一社会信用代码:92520103BA65288K39  \n" +
            "经  营  者:韩明芬  \n" +
            "名     称:千寻烤肉店  \n" +
            "类     型:个体工商户  \n" +
            "经 营 场 所:贵州省贵阳市云岩区太平路12号  \n" +
            "组成形式:个人经营  \n" +
            "注册日期:2017年10月12日  \n" +
            "经营范围:餐饮：小吃  ";
    String GuiZhou_GuiYang = "注册号：520103601028726  \n" +
            "名称：贵阳云岩新洪连餐馆  \n" +
            "类型：个体工商户  \n" +
            "经营场所：贵州省贵阳市云岩区市北路56号A幢3单元1层  \n" +
            "法定代表人：杨存  \n" +
            "组成形式：个人经营    \n" +
            "注册日期：2016年10月13日  \n" +
            "经营范围：餐饮（以许可证审批为准）（以下空白）  ";

    //西藏
    String XiZang = "统一社会信用代码:92540125MA6T3T333T;  \n" +
            "名称:马亥山烤羊肉美食店;  \n" +
            "经营者:马国民;  \n" +
            "开业日期:2017年08月31日;  \n" +
            "企业信用信息公示系统网址:http://220.182.3.104/EntInfo.jspx?id=YmFnc294eHh4eXNveg==  ";

    //甘肃
    String GanSu = "统一社会信用代码:92620722MA73PWKY1H  \n" +
            "注册号:620722600150602  \n" +
            "经营者:赵明千  \n" +
            "名称:民乐县福滋福味饺子馆  \n" +
            "类型:个体工商户  \n" +
            "经营场所:甘肃省张掖市民乐县县城友谊商城三楼  \n" +
            "组成形式:个人经营  \n" +
            "注册日期:2018年04月24日  \n" +
            "登记机关:民乐县工商行政管理和质量技术监督局  \n" +
            "信用信息公示地址:http://gs.gsxt.gov.cn/gsxygs/pubSearch/basicView?queryType=query&pripid=6207220005201804240002X&entcate=ind  \n" +
            "备案地址:\n" +
            "http://gs.gsxt.gov.cn/gsxygs/pubSearch/dzhyEwInfo?uniscid=92620722MA73PWKY1H  ";

    //宁夏
    String NingXia2 = "统一社会信用代码:92640103MA76DPR063  \n" +
            "经营者:马巧铃  \n" +
            "名称:银川市兴庆区清味轩美食苑餐厅  \n" +
            "经营场所:银川市兴庆区南薰东路红运综合楼1号2号3号楼面北18号营业房  \n" +
            "组成形式:个人经营  \n" +
            "注册日期:2018年3月28日  \n" +
            "经营范围:中餐服务...  \n" +
            "公示系统网址:www.ngsh.gov.cn  ";
    String NingXia = "注册号:640323600107003  \n" +
            "名称:盐池县永胜定边肝子酿皮店  \n" +
            "经营场所:盐池县振远西街37号  \n" +
            "经营者:窦巧玲  \n" +
            "组成形式:家庭经营  \n" +
            "注册日期:2013年05月13日  \n" +
            "经营范围:小型餐馆（不含凉菜）服务***  \n" +
            "（依法须经批准的项目，经相关部门批...  \n" +
            "公示系统网址:www.ngsh.gov.cn  ";
    //新疆
    String XinJiang = "统一社会信用代码：92652722MA77X7G748;企业名称：精河县城镇果陪乐鲜榨果汁饮品店;经营者：热依扎·吾拉孜汗 ;登记机关：精河县工商行政管理局;登记日期：2018年04月12日; 详询信用公示系统：http://xj.gsxt.gov.cn/";

    //湖北
    String HuBei = "注册号：名称：  \n" +
            "类型：个体工商户    \n" +
            "经营场所：当阳市玉阳办事处子龙路（香榭水岸商铺）  \n" +
            "经营者：杨家林  \n" +
            "组成形式：个人经营  \n" +
            "注册日期：2018年05月07日  \n" +
            "经营范围：正餐服务（涉及许可经营项目，应取得相关部门许可后方可经营）***<br>  \n";
    String HuBei2 = "企业信用代码:92420111MA4JHH1E1N  \n" +
            "经营者:黄佩  \n" +
            "名称:武汉市洪山区骨巨鸡餐厅  \n" +
            "类型:个体工商户  \n" +
            "经营场所：湖北省武汉市洪山区卓刀泉路108号凯乐桂园第S-2幢3层16号房  \n" +
            "组织形式:个人经营  \n" +
            "注册日期：2018年05月03日  \n";

}
